app/controllers/api/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("name", "lastname", "email", "country", "voivodeship", "city", "post_code", "phone", "company", "nip", "personal_number", "passwd", "note", "created_at", "updated_at", "role") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16) RETURNING "id"

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "name" = $1, "email" = $2, "country" = $3, "phone" = $4, "updated_at" = $5 WHERE "users"."id" = $6  [["name", "John"], ["email", "mandie.schoen@tillman-greenholt.example"], ["country", "Tuvalu"], ["phone", "+3718825916818"], ["updated_at", "2023-05-15 14:09:42.897155"], ["id", 74]]